<?xml version="1.0" ?>
<net batch="1" name="latest_net_G" version="4">
	<layers>
		<layer id="0" name="input.1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="118" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,3,3" pads_end="0,0,3,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>262</dim>
					<dim>262</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="119" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>262</dim>
					<dim>262</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2989068" size="37632"/>
				<biases offset="3026700" size="256"/>
			</blobs>
		</layer>
		<layer id="3" name="122/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="122/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3026956" size="256"/>
				<biases offset="3027212" size="256"/>
			</blobs>
		</layer>
		<layer id="5" name="123" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="124" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2693644" size="294912"/>
				<biases offset="2988556" size="512"/>
			</blobs>
		</layer>
		<layer id="7" name="127/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="127/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3027468" size="512"/>
				<biases offset="3027980" size="512"/>
			</blobs>
		</layer>
		<layer id="9" name="128" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="129" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1512972" size="1179648"/>
				<biases offset="2692620" size="1024"/>
			</blobs>
		</layer>
		<layer id="11" name="132/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="132/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="13" name="133" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="134" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="135" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5390860" size="2359296"/>
				<biases offset="7750156" size="1024"/>
			</blobs>
		</layer>
		<layer id="16" name="138/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="138/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="18" name="139" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="140" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="141" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3030540" size="2359296"/>
				<biases offset="5389836" size="1024"/>
			</blobs>
		</layer>
		<layer id="21" name="144/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="144/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="23" name="145" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="146" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="147" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10111500" size="2359296"/>
				<biases offset="12470796" size="1024"/>
			</blobs>
		</layer>
		<layer id="26" name="150/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="150/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="28" name="151" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="152" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="153" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7751180" size="2359296"/>
				<biases offset="10110476" size="1024"/>
			</blobs>
		</layer>
		<layer id="31" name="156/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="156/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="33" name="157" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="158" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="159" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14832140" size="2359296"/>
				<biases offset="17191436" size="1024"/>
			</blobs>
		</layer>
		<layer id="36" name="162/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="162/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="38" name="163" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="164" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="165" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12471820" size="2359296"/>
				<biases offset="14831116" size="1024"/>
			</blobs>
		</layer>
		<layer id="41" name="168/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="168/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="43" name="169" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="170" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="171" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="19552780" size="2359296"/>
				<biases offset="21912076" size="1024"/>
			</blobs>
		</layer>
		<layer id="46" name="174/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="174/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="48" name="175" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="176" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="177" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="17192460" size="2359296"/>
				<biases offset="19551756" size="1024"/>
			</blobs>
		</layer>
		<layer id="51" name="180/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="180/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="53" name="181" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="182" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="183" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24273420" size="2359296"/>
				<biases offset="26632716" size="1024"/>
			</blobs>
		</layer>
		<layer id="56" name="186/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="186/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="58" name="187" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="188" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="189" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21913100" size="2359296"/>
				<biases offset="24272396" size="1024"/>
			</blobs>
		</layer>
		<layer id="61" name="192/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="192/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="63" name="193" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="194" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="195" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="28994060" size="2359296"/>
				<biases offset="31353356" size="1024"/>
			</blobs>
		</layer>
		<layer id="66" name="198/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="198/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="68" name="199" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="200" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="201" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26633740" size="2359296"/>
				<biases offset="28993036" size="1024"/>
			</blobs>
		</layer>
		<layer id="71" name="204/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="204/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="73" name="205" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="206" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="207" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="33714700" size="2359296"/>
				<biases offset="36073996" size="1024"/>
			</blobs>
		</layer>
		<layer id="76" name="210/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="210/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="78" name="211" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="212" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="213" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31354380" size="2359296"/>
				<biases offset="33713676" size="1024"/>
			</blobs>
		</layer>
		<layer id="81" name="216/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="216/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="83" name="217" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="218" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="219" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="38435340" size="2359296"/>
				<biases offset="40794636" size="1024"/>
			</blobs>
		</layer>
		<layer id="86" name="222/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="222/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="88" name="223" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="224" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="225" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="36075020" size="2359296"/>
				<biases offset="38434316" size="1024"/>
			</blobs>
		</layer>
		<layer id="91" name="228/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="228/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="93" name="229" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="230" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="231" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="43155980" size="2359296"/>
				<biases offset="45515276" size="1024"/>
			</blobs>
		</layer>
		<layer id="96" name="234/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="234/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="98" name="235" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="236" precision="FP32" type="Pad">
			<data pad_mode="reflect" pad_value="0" pads_begin="0,0,1,1" pads_end="0,0,1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="237" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>66</dim>
					<dim>66</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40795660" size="2359296"/>
				<biases offset="43154956" size="1024"/>
			</blobs>
		</layer>
		<layer id="101" name="240/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="240/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3028492" size="1024"/>
				<biases offset="3029516" size="1024"/>
			</blobs>
		</layer>
		<layer id="103" name="241" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="242" precision="FP32" type="Deconvolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="332812" size="1179648"/>
				<biases offset="1512460" size="512"/>
			</blobs>
		</layer>
		<layer id="105" name="245/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="245/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3027468" size="512"/>
				<biases offset="3027980" size="512"/>
			</blobs>
		</layer>
		<layer id="107" name="246" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="247" precision="FP32" type="Deconvolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="37644" size="294912"/>
				<biases offset="332556" size="256"/>
			</blobs>
		</layer>
		<layer id="109" name="250/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
